results/cluster-run-logs/stress-analyzer-down-demo.log

running (0m28.9s), 003/145 VUs, 719 complete and 0 interrupted iterations
constant_rate   [  48% ] 003/145 VUs  0m28.9s/1m0s  25.00 iters/s

running (0m29.9s), 004/145 VUs, 744 complete and 0 interrupted iterations
constant_rate   [  50% ] 004/145 VUs  0m29.9s/1m0s  25.00 iters/s

running (0m30.9s), 003/145 VUs, 769 complete and 0 interrupted iterations
constant_rate   [  51% ] 003/145 VUs  0m30.9s/1m0s  25.00 iters/s

running (0m31.9s), 005/145 VUs, 793 complete and 0 interrupted iterations
constant_rate   [  53% ] 005/145 VUs  0m31.9s/1m0s  25.00 iters/s

running (0m32.9s), 003/145 VUs, 819 complete and 0 interrupted iterations
constant_rate   [  55% ] 003/145 VUs  0m32.9s/1m0s  25.00 iters/s

running (0m33.9s), 004/145 VUs, 843 complete and 0 interrupted iterations
constant_rate   [  56% ] 004/145 VUs  0m33.9s/1m0s  25.00 iters/s

running (0m34.9s), 004/145 VUs, 869 complete and 0 interrupted iterations
constant_rate   [  58% ] 004/145 VUs  0m34.9s/1m0s  25.00 iters/s

running (0m35.9s), 003/145 VUs, 894 complete and 0 interrupted iterations
constant_rate   [  60% ] 003/145 VUs  0m35.9s/1m0s  25.00 iters/s

running (0m36.9s), 004/145 VUs, 918 complete and 0 interrupted iterations
constant_rate   [  61% ] 004/145 VUs  0m36.9s/1m0s  25.00 iters/s

running (0m37.9s), 003/145 VUs, 944 complete and 0 interrupted iterations
constant_rate   [  63% ] 003/145 VUs  0m37.9s/1m0s  25.00 iters/s

running (0m38.9s), 002/145 VUs, 970 complete and 0 interrupted iterations
constant_rate   [  65% ] 002/145 VUs  0m38.9s/1m0s  25.00 iters/s

running (0m39.9s), 003/145 VUs, 994 complete and 0 interrupted iterations
constant_rate   [  66% ] 003/145 VUs  0m39.9s/1m0s  25.00 iters/s

running (0m40.9s), 003/145 VUs, 1019 complete and 0 interrupted iterations
constant_rate   [  68% ] 003/145 VUs  0m40.9s/1m0s  25.00 iters/s

running (0m41.9s), 004/145 VUs, 1044 complete and 0 interrupted iterations
constant_rate   [  70% ] 004/145 VUs  0m41.9s/1m0s  25.00 iters/s

running (0m42.9s), 005/145 VUs, 1068 complete and 0 interrupted iterations
constant_rate   [  71% ] 005/145 VUs  0m42.9s/1m0s  25.00 iters/s

running (0m43.9s), 003/145 VUs, 1094 complete and 0 interrupted iterations
constant_rate   [  73% ] 003/145 VUs  0m43.9s/1m0s  25.00 iters/s

running (0m44.9s), 004/145 VUs, 1119 complete and 0 interrupted iterations
constant_rate   [  75% ] 004/145 VUs  0m44.9s/1m0s  25.00 iters/s

running (0m45.9s), 004/145 VUs, 1144 complete and 0 interrupted iterations
constant_rate   [  76% ] 004/145 VUs  0m45.9s/1m0s  25.00 iters/s

running (0m46.9s), 004/145 VUs, 1169 complete and 0 interrupted iterations
constant_rate   [  78% ] 004/145 VUs  0m46.9s/1m0s  25.00 iters/s

running (0m47.9s), 004/145 VUs, 1193 complete and 0 interrupted iterations
constant_rate   [  80% ] 004/145 VUs  0m47.9s/1m0s  25.00 iters/s

running (0m48.9s), 003/145 VUs, 1219 complete and 0 interrupted iterations
constant_rate   [  81% ] 003/145 VUs  0m48.9s/1m0s  25.00 iters/s

running (0m49.9s), 003/145 VUs, 1244 complete and 0 interrupted iterations
constant_rate   [  83% ] 003/145 VUs  0m49.9s/1m0s  25.00 iters/s

running (0m50.9s), 002/145 VUs, 1270 complete and 0 interrupted iterations
constant_rate   [  85% ] 002/145 VUs  0m50.9s/1m0s  25.00 iters/s

running (0m51.9s), 004/145 VUs, 1294 complete and 0 interrupted iterations
constant_rate   [  86% ] 004/145 VUs  0m51.9s/1m0s  25.00 iters/s

running (0m52.9s), 004/145 VUs, 1319 complete and 0 interrupted iterations
constant_rate   [  88% ] 004/145 VUs  0m52.9s/1m0s  25.00 iters/s

running (0m53.9s), 003/145 VUs, 1344 complete and 0 interrupted iterations
constant_rate   [  90% ] 003/145 VUs  0m53.9s/1m0s  25.00 iters/s

running (0m54.9s), 003/145 VUs, 1369 complete and 0 interrupted iterations
constant_rate   [  91% ] 003/145 VUs  0m54.9s/1m0s  25.00 iters/s

running (0m55.9s), 002/145 VUs, 1395 complete and 0 interrupted iterations
constant_rate   [  93% ] 002/145 VUs  0m55.9s/1m0s  25.00 iters/s

running (0m56.9s), 004/145 VUs, 1419 complete and 0 interrupted iterations
constant_rate   [  95% ] 004/145 VUs  0m56.9s/1m0s  25.00 iters/s

running (0m57.9s), 004/145 VUs, 1444 complete and 0 interrupted iterations
constant_rate   [  96% ] 004/145 VUs  0m57.9s/1m0s  25.00 iters/s

running (0m58.9s), 003/145 VUs, 1469 complete and 0 interrupted iterations
constant_rate   [  98% ] 003/145 VUs  0m58.9s/1m0s  25.00 iters/s

running (0m59.9s), 003/145 VUs, 1494 complete and 0 interrupted iterations
constant_rate   [ 100% ] 003/145 VUs  0m59.9s/1m0s  25.00 iters/s

     ✓ status is 200
     ✓ has user name

     checks.........................: 100.00% 3002 out of 3002
     data_received..................: 639 kB  11 kB/s
     data_sent......................: 351 kB  5.8 kB/s
     http_req_blocked...............: avg=1.16ms   min=5.09µs   med=7.64µs   max=30.42ms  p(90)=46.87µs  p(95)=1.31ms  
     http_req_connecting............: avg=1.14ms   min=0s       med=0s       max=30.29ms  p(90)=0s       p(95)=1.1ms   
   ✓ http_req_duration..............: avg=37.16ms  min=2.65ms   med=5.6ms    max=158.79ms p(90)=74.4ms   p(95)=74.83ms 
       { expected_response:true }...: avg=37.16ms  min=2.65ms   med=5.6ms    max=158.79ms p(90)=74.4ms   p(95)=74.83ms 
   ✓ http_req_failed................: 0.00%   0 out of 1501
     http_req_receiving.............: avg=96.68µs  min=38.41µs  med=91.29µs  max=615.19µs p(90)=129.97µs p(95)=146.72µs
     http_req_sending...............: avg=50.62µs  min=23.16µs  med=40.21µs  max=1.01ms   p(90)=82.86µs  p(95)=115.78µs
     http_req_tls_handshaking.......: avg=0s       min=0s       med=0s       max=0s       p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=37.01ms  min=2.52ms   med=5.41ms   max=158.65ms p(90)=74.27ms  p(95)=74.62ms 
     http_reqs......................: 1501    24.943286/s
     iteration_duration.............: avg=139.28ms min=103.98ms med=106.97ms max=260.21ms p(90)=175.74ms p(95)=179.86ms
     iterations.....................: 1501    24.943286/s
     vus............................: 3       min=2            max=5  
     vus_max........................: 145     min=145          max=145


running (1m00.2s), 000/145 VUs, 1501 complete and 0 interrupted iterations
constant_rate ✓ [ 100% ] 000/145 VUs  1m0s  25.00 iters/s
Error from server (Forbidden): endpoints "web" is forbidden: User "system:serviceaccount:svastik:stress-analyzer" cannot get resource "endpoints" in API group "" in the namespace "svastik"
[measure-ctx] pre_k6 yaml_repl=2 dep_spec=2 ready=2 updated=2 available=2 hpa_cur=2 hpa_des=2 hpa_max=2 pod_count=2 endpoints=0
[measure-ctx] pod name=web-694bbcb97b-6gskw phase=Running ready=1/1 ip=10.42.4.54 node=ceras2 start=2026-06-10T05:21:47Z
[measure-ctx] pod name=web-694bbcb97b-wrhqg phase=Running ready=1/1 ip=10.42.7.98 node=worker2 start=2026-06-10T05:21:24Z

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: /app/benchmarks/load-tests/k6/robotshop_login.js
        output: -

     scenarios: (100.00%) 1 scenario, 225 max VUs, 2m0s max duration (incl. graceful stop):
              * constant_rate: 25.00 iterations/s for 1m30s (maxVUs: 145-225, gracefulStop: 30s)


running (0m00.8s), 004/145 VUs, 18 complete and 0 interrupted iterations
constant_rate   [   1% ] 004/145 VUs  0m00.8s/1m30s  25.00 iters/s

running (0m01.8s), 004/145 VUs, 43 complete and 0 interrupted iterations
constant_rate   [   2% ] 004/145 VUs  0m01.8s/1m30s  25.00 iters/s

running (0m02.8s), 004/145 VUs, 68 complete and 0 interrupted iterations
constant_rate   [   3% ] 004/145 VUs  0m02.8s/1m30s  25.00 iters/s

running (0m03.8s), 004/145 VUs, 93 complete and 0 interrupted iterations
constant_rate   [   4% ] 004/145 VUs  0m03.8s/1m30s  25.00 iters/s

running (0m04.8s), 004/145 VUs, 118 complete and 0 interrupted iterations
constant_rate   [   5% ] 004/145 VUs  0m04.8s/1m30s  25.00 iters/s

running (0m05.8s), 004/145 VUs, 143 complete and 0 interrupted iterations
constant_rate   [   6% ] 004/145 VUs  0m05.8s/1m30s  25.00 iters/s

running (0m06.8s), 004/145 VUs, 168 complete and 0 interrupted iterations
constant_rate   [   8% ] 004/145 VUs  0m06.8s/1m30s  25.00 iters/s

running (0m07.8s), 004/145 VUs, 193 complete and 0 interrupted iterations
constant_rate   [   9% ] 004/145 VUs  0m07.8s/1m30s  25.00 iters/s

running (0m08.8s), 004/145 VUs, 218 complete and 0 interrupted iterations
constant_rate   [  10% ] 004/145 VUs  0m08.8s/1m30s  25.00 iters/s

running (0m09.8s), 004/145 VUs, 243 complete and 0 interrupted iterations
constant_rate   [  11% ] 004/145 VUs  0m09.8s/1m30s  25.00 iters/s

running (0m10.8s), 004/145 VUs, 268 complete and 0 interrupted iterations
constant_rate   [  12% ] 004/145 VUs  0m10.8s/1m30s  25.00 iters/s

running (0m11.8s), 004/145 VUs, 293 complete and 0 interrupted iterations
constant_rate   [  13% ] 004/145 VUs  0m11.8s/1m30s  25.00 iters/s

running (0m12.8s), 004/145 VUs, 318 complete and 0 interrupted iterations
constant_rate   [  14% ] 004/145 VUs  0m12.8s/1m30s  25.00 iters/s

running (0m13.8s), 004/145 VUs, 343 complete and 0 interrupted iterations
constant_rate   [  15% ] 004/145 VUs  0m13.8s/1m30s  25.00 iters/s

running (0m14.8s), 004/145 VUs, 368 complete and 0 interrupted iterations
constant_rate   [  16% ] 004/145 VUs  0m14.8s/1m30s  25.00 iters/s

running (0m15.8s), 003/145 VUs, 394 complete and 0 interrupted iterations
constant_rate   [  18% ] 003/145 VUs  0m15.8s/1m30s  25.00 iters/s

running (0m16.8s), 003/145 VUs, 419 complete and 0 interrupted iterations
constant_rate   [  19% ] 003/145 VUs  0m16.8s/1m30s  25.00 iters/s

running (0m17.8s), 004/145 VUs, 443 complete and 0 interrupted iterations
constant_rate   [  20% ] 004/145 VUs  0m17.8s/1m30s  25.00 iters/s

running (0m18.8s), 004/145 VUs, 468 complete and 0 interrupted iterations
constant_rate   [  21% ] 004/145 VUs  0m18.8s/1m30s  25.00 iters/s

running (0m19.8s), 004/145 VUs, 493 complete and 0 interrupted iterations
constant_rate   [  22% ] 004/145 VUs  0m19.8s/1m30s  25.00 iters/s

running (0m20.8s), 004/145 VUs, 518 complete and 0 interrupted iterations
constant_rate   [  23% ] 004/145 VUs  0m20.8s/1m30s  25.00 iters/s

running (0m21.8s), 004/145 VUs, 543 complete and 0 interrupted iterations
constant_rate   [  24% ] 004/145 VUs  0m21.8s/1m30s  25.00 iters/s

running (0m22.8s), 003/145 VUs, 569 complete and 0 interrupted iterations
constant_rate   [  25% ] 003/145 VUs  0m22.8s/1m30s  25.00 iters/s

running (0m23.8s), 004/145 VUs, 593 complete and 0 interrupted iterations
constant_rate   [  26% ] 004/145 VUs  0m23.8s/1m30s  25.00 iters/s

running (0m24.8s), 004/145 VUs, 618 complete and 0 interrupted iterations
constant_rate   [  28% ] 004/145 VUs  0m24.8s/1m30s  25.00 iters/s

running (0m25.8s), 003/145 VUs, 644 complete and 0 interrupted iterations
constant_rate   [  29% ] 003/145 VUs  0m25.8s/1m30s  25.00 iters/s

running (0m26.8s), 004/145 VUs, 668 complete and 0 interrupted iterations
constant_rate   [  30% ] 004/145 VUs  0m26.8s/1m30s  25.00 iters/s

running (0m27.8s), 004/145 VUs, 693 complete and 0 interrupted iterations
constant_rate   [  31% ] 004/145 VUs  0m27.8s/1m30s  25.00 iters/s

running (0m28.8s), 003/145 VUs, 719 complete and 0 interrupted iterations
constant_rate   [  32% ] 003/145 VUs  0m28.8s/1m30s  25.00 iters/s

running (0m29.8s), 004/145 VUs, 743 complete and 0 interrupted iterations
constant_rate   [  33% ] 004/145 VUs  0m29.8s/1m30s  25.00 iters/s

running (0m30.8s), 005/145 VUs, 767 complete and 0 interrupted iterations
constant_rate   [  34% ] 005/145 VUs  0m30.8s/1m30s  25.00 iters/s

running (0m31.8s), 004/145 VUs, 793 complete and 0 interrupted iterations
constant_rate   [  35% ] 004/145 VUs  0m31.8s/1m30s  25.00 iters/s

running (0m32.8s), 004/145 VUs, 818 complete and 0 interrupted iterations
constant_rate   [  36% ] 004/145 VUs  0m32.8s/1m30s  25.00 iters/s

running (0m33.8s), 004/145 VUs, 843 complete and 0 interrupted iterations
constant_rate   [  38% ] 004/145 VUs  0m33.8s/1m30s  25.00 iters/s

running (0m34.8s), 004/145 VUs, 868 complete and 0 interrupted iterations
constant_rate   [  39% ] 004/145 VUs  0m34.8s/1m30s  25.00 iters/s

running (0m35.8s), 004/145 VUs, 893 complete and 0 interrupted iterations
constant_rate   [  40% ] 004/145 VUs  0m35.8s/1m30s  25.00 iters/s

running (0m36.8s), 005/145 VUs, 917 complete and 0 interrupted iterations
constant_rate   [  41% ] 005/145 VUs  0m36.8s/1m30s  25.00 iters/s

running (0m37.8s), 004/145 VUs, 943 complete and 0 interrupted iterations
constant_rate   [  42% ] 004/145 VUs  0m37.8s/1m30s  25.00 iters/s

running (0m38.8s), 003/145 VUs, 969 complete and 0 interrupted iterations
constant_rate   [  43% ] 003/145 VUs  0m38.8s/1m30s  25.00 iters/s

running (0m39.8s), 004/145 VUs, 993 complete and 0 interrupted iterations
constant_rate   [  44% ] 004/145 VUs  0m39.8s/1m30s  25.00 iters/s

running (0m40.8s), 004/145 VUs, 1018 complete and 0 interrupted iterations
constant_rate   [  45% ] 004/145 VUs  0m40.8s/1m30s  25.00 iters/s

running (0m41.8s), 004/145 VUs, 1043 complete and 0 interrupted iterations
constant_rate   [  46% ] 004/145 VUs  0m41.8s/1m30s  25.00 iters/s

running (0m42.8s), 004/145 VUs, 1068 complete and 0 interrupted iterations
constant_rate   [  48% ] 004/145 VUs  0m42.8s/1m30s  25.00 iters/s

running (0m43.8s), 004/145 VUs, 1093 complete and 0 interrupted iterations
constant_rate   [  49% ] 004/145 VUs  0m43.8s/1m30s  25.00 iters/s

running (0m44.8s), 004/145 VUs, 1118 complete and 0 interrupted iterations
constant_rate   [  50% ] 004/145 VUs  0m44.8s/1m30s  25.00 iters/s

running (0m45.8s), 004/145 VUs, 1143 complete and 0 interrupted iterations
constant_rate   [  51% ] 004/145 VUs  0m45.8s/1m30s  25.00 iters/s

running (0m46.8s), 004/145 VUs, 1168 complete and 0 interrupted iterations
constant_rate   [  52% ] 004/145 VUs  0m46.8s/1m30s  25.00 iters/s

running (0m47.8s), 005/145 VUs, 1192 complete and 0 interrupted iterations
constant_rate   [  53% ] 005/145 VUs  0m47.8s/1m30s  25.00 iters/s

running (0m48.8s), 004/145 VUs, 1218 complete and 0 interrupted iterations
constant_rate   [  54% ] 004/145 VUs  0m48.8s/1m30s  25.00 iters/s

running (0m49.8s), 004/145 VUs, 1243 complete and 0 interrupted iterations
constant_rate   [  55% ] 004/145 VUs  0m49.8s/1m30s  25.00 iters/s

running (0m50.8s), 004/145 VUs, 1268 complete and 0 interrupted iterations
constant_rate   [  56% ] 004/145 VUs  0m50.8s/1m30s  25.00 iters/s

running (0m51.8s), 004/145 VUs, 1293 complete and 0 interrupted iterations
constant_rate   [  58% ] 004/145 VUs  0m51.8s/1m30s  25.00 iters/s

running (0m52.8s), 004/145 VUs, 1318 complete and 0 interrupted iterations
constant_rate   [  59% ] 004/145 VUs  0m52.8s/1m30s  25.00 iters/s

running (0m53.8s), 005/145 VUs, 1342 complete and 0 interrupted iterations
constant_rate   [  60% ] 005/145 VUs  0m53.8s/1m30s  25.00 iters/s

running (0m54.8s), 004/145 VUs, 1368 complete and 0 interrupted iterations
constant_rate   [  61% ] 004/145 VUs  0m54.8s/1m30s  25.00 iters/s

running (0m55.8s), 004/145 VUs, 1393 complete and 0 interrupted iterations
constant_rate   [  62% ] 004/145 VUs  0m55.8s/1m30s  25.00 iters/s

running (0m56.8s), 004/145 VUs, 1418 complete and 0 interrupted iterations
constant_rate   [  63% ] 004/145 VUs  0m56.8s/1m30s  25.00 iters/s

running (0m57.8s), 003/145 VUs, 1444 complete and 0 interrupted iterations
constant_rate   [  64% ] 003/145 VUs  0m57.8s/1m30s  25.00 iters/s

running (0m58.8s), 004/145 VUs, 1468 complete and 0 interrupted iterations
constant_rate   [  65% ] 004/145 VUs  0m58.8s/1m30s  25.00 iters/s

running (0m59.8s), 004/145 VUs, 1493 complete and 0 interrupted iterations
constant_rate   [  66% ] 004/145 VUs  0m59.8s/1m30s  25.00 iters/s

running (1m00.8s), 004/145 VUs, 1518 complete and 0 interrupted iterations
constant_rate   [  68% ] 004/145 VUs  1m00.8s/1m30s  25.00 iters/s

running (1m01.8s), 004/145 VUs, 1543 complete and 0 interrupted iterations
constant_rate   [  69% ] 004/145 VUs  1m01.8s/1m30s  25.00 iters/s

running (1m02.8s), 004/145 VUs, 1568 complete and 0 interrupted iterations
constant_rate   [  70% ] 004/145 VUs  1m02.8s/1m30s  25.00 iters/s

running (1m03.8s), 004/145 VUs, 1593 complete and 0 interrupted iterations
constant_rate   [  71% ] 004/145 VUs  1m03.8s/1m30s  25.00 iters/s

running (1m04.8s), 004/145 VUs, 1618 complete and 0 interrupted iterations
constant_rate   [  72% ] 004/145 VUs  1m04.8s/1m30s  25.00 iters/s

running (1m05.8s), 004/145 VUs, 1643 complete and 0 interrupted iterations
constant_rate   [  73% ] 004/145 VUs  1m05.8s/1m30s  25.00 iters/s

running (1m06.8s), 005/145 VUs, 1667 complete and 0 interrupted iterations
constant_rate   [  74% ] 005/145 VUs  1m06.8s/1m30s  25.00 iters/s

running (1m07.8s), 003/145 VUs, 1694 complete and 0 interrupted iterations
constant_rate   [  75% ] 003/145 VUs  1m07.8s/1m30s  25.00 iters/s

running (1m08.8s), 004/145 VUs, 1718 complete and 0 interrupted iterations
constant_rate   [  76% ] 004/145 VUs  1m08.8s/1m30s  25.00 iters/s

running (1m09.8s), 004/145 VUs, 1743 complete and 0 interrupted iterations
constant_rate   [  78% ] 004/145 VUs  1m09.8s/1m30s  25.00 iters/s

running (1m10.8s), 004/145 VUs, 1768 complete and 0 interrupted iterations
constant_rate   [  79% ] 004/145 VUs  1m10.8s/1m30s  25.00 iters/s

running (1m11.8s), 004/145 VUs, 1793 complete and 0 interrupted iterations
constant_rate   [  80% ] 004/145 VUs  1m11.8s/1m30s  25.00 iters/s

running (1m12.8s), 004/145 VUs, 1818 complete and 0 interrupted iterations
constant_rate   [  81% ] 004/145 VUs  1m12.8s/1m30s  25.00 iters/s

running (1m13.8s), 004/145 VUs, 1843 complete and 0 interrupted iterations
constant_rate   [  82% ] 004/145 VUs  1m13.8s/1m30s  25.00 iters/s

running (1m14.8s), 004/145 VUs, 1868 complete and 0 interrupted iterations
constant_rate   [  83% ] 004/145 VUs  1m14.8s/1m30s  25.00 iters/s

running (1m15.8s), 004/145 VUs, 1893 complete and 0 interrupted iterations
constant_rate   [  84% ] 004/145 VUs  1m15.8s/1m30s  25.00 iters/s

running (1m16.8s), 004/145 VUs, 1918 complete and 0 interrupted iterations
constant_rate   [  85% ] 004/145 VUs  1m16.8s/1m30s  25.00 iters/s

running (1m17.8s), 004/145 VUs, 1943 complete and 0 interrupted iterations
constant_rate   [  86% ] 004/145 VUs  1m17.8s/1m30s  25.00 iters/s

running (1m18.8s), 004/145 VUs, 1968 complete and 0 interrupted iterations
constant_rate   [  88% ] 004/145 VUs  1m18.8s/1m30s  25.00 iters/s

running (1m19.8s), 004/145 VUs, 1993 complete and 0 interrupted iterations
constant_rate   [  89% ] 004/145 VUs  1m19.8s/1m30s  25.00 iters/s

running (1m20.8s), 004/145 VUs, 2018 complete and 0 interrupted iterations
constant_rate   [  90% ] 004/145 VUs  1m20.8s/1m30s  25.00 iters/s

running (1m21.8s), 004/145 VUs, 2043 complete and 0 interrupted iterations
constant_rate   [  91% ] 004/145 VUs  1m21.8s/1m30s  25.00 iters/s

running (1m22.8s), 004/145 VUs, 2068 complete and 0 interrupted iterations
constant_rate   [  92% ] 004/145 VUs  1m22.8s/1m30s  25.00 iters/s

running (1m23.8s), 004/145 VUs, 2093 complete and 0 interrupted iterations
constant_rate   [  93% ] 004/145 VUs  1m23.8s/1m30s  25.00 iters/s

running (1m24.8s), 004/145 VUs, 2118 complete and 0 interrupted iterations
constant_rate   [  94% ] 004/145 VUs  1m24.8s/1m30s  25.00 iters/s

running (1m25.8s), 004/145 VUs, 2143 complete and 0 interrupted iterations
constant_rate   [  95% ] 004/145 VUs  1m25.8s/1m30s  25.00 iters/s

running (1m26.8s), 004/145 VUs, 2168 complete and 0 interrupted iterations
constant_rate   [  96% ] 004/145 VUs  1m26.8s/1m30s  25.00 iters/s

running (1m27.8s), 004/145 VUs, 2193 complete and 0 interrupted iterations
constant_rate   [  98% ] 004/145 VUs  1m27.8s/1m30s  25.00 iters/s

running (1m28.8s), 004/145 VUs, 2218 complete and 0 interrupted iterations
constant_rate   [  99% ] 004/145 VUs  1m28.8s/1m30s  25.00 iters/s

running (1m29.8s), 005/145 VUs, 2242 complete and 0 interrupted iterations
constant_rate   [ 100% ] 005/145 VUs  1m29.8s/1m30s  25.00 iters/s

     ✓ status is 200
     ✓ has user name

     checks.........................: 100.00% 4502 out of 4502
     data_received..................: 959 kB  11 kB/s
     data_sent......................: 527 kB  5.8 kB/s
     http_req_blocked...............: avg=833.97µs min=5.08µs   med=7.85µs   max=29.89ms  p(90)=14.17µs  p(95)=968.13µs
     http_req_connecting............: avg=817.31µs min=0s       med=0s       max=29.77ms  p(90)=0s       p(95)=857.59µs
   ✓ http_req_duration..............: avg=39.96ms  min=2.71ms   med=72.95ms  max=241.67ms p(90)=74.4ms   p(95)=74.68ms 
       { expected_response:true }...: avg=39.96ms  min=2.71ms   med=72.95ms  max=241.67ms p(90)=74.4ms   p(95)=74.68ms 
   ✓ http_req_failed................: 0.00%   0 out of 2251
     http_req_receiving.............: avg=93.98µs  min=42.75µs  med=90.02µs  max=324.61µs p(90)=124.43µs p(95)=141.44µs
     http_req_sending...............: avg=49.14µs  min=21.98µs  med=41.7µs   max=212.72µs p(90)=71.28µs  p(95)=98.11µs 
     http_req_tls_handshaking.......: avg=0s       min=0s       med=0s       max=0s       p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=39.82ms  min=2.52ms   med=72.85ms  max=241.52ms p(90)=74.23ms  p(95)=74.51ms 
     http_reqs......................: 2251    24.973693/s
     iteration_duration.............: avg=141.76ms min=103.99ms med=173.65ms max=343.17ms p(90)=175.63ms p(95)=176.56ms
     iterations.....................: 2251    24.973693/s
     vus............................: 5       min=3            max=5  
     vus_max........................: 145     min=145          max=145


running (1m30.1s), 000/145 VUs, 2251 complete and 0 interrupted iterations
constant_rate ✓ [ 100% ] 000/145 VUs  1m30s  25.00 iters/s
[pipeline] k6_done exit=0 http_req_failed=0 checks=1 p95_ms=74.68936450000001 http_reqs=2251
[pipeline] analysis_start
[analysis] run_analysis_start run_dir=/app/results/squeeze-compare-vanilla-llm/run-1/iteration-6 deployment_yaml=/app/infra/k8s/spark/robot-shop-web-deployment.yaml hpa_yaml=/app/infra/k8s/spark/robot-shop-web-hpa.yaml shared_canonical=False
[analysis] prometheus_collect_start namespace=svastik deployment=web url=http://my-kube-prometheus-stack-prometheus.monitoring.svc:9090
[prom] collect_start namespace=svastik deployment=web window=(1781068997.855,1781069088.341) step=5s
[prom] collect_done cpu_util_request_pct=104.4 burn_m=167.0 cpu_util_request_pct_peak=110.0 mem_util_pct=18.3 cpu_series_matched=True mem_series_matched=True cpu_attempts=1 mem_attempts=1 cpu_mode=per_pod_series_sum mem_mode=per_pod_series_sum cpu_query_used='rate(container_cpu_usage_seconds_total{namespace="svastik",pod=~"web-.+",container!="",container!="POD"}[1m])' samples=19/12 step=5s rate=1m per_pod_sum_m=167.0 aggregate_delta_m=0.0 trustworthy=True
[prom] collect_per_pod pod=web-694bbcb97b-wrhqg container=web mean_m=109.6 peak_m=116.1 samples=19
[prom] collect_per_pod pod=web-694bbcb97b-6gskw container=web mean_m=57.4 peak_m=59.8 samples=19
[analysis] prometheus_collect_done burn_m=167.0 cpu_pct_req=104.4 prom_pods=2 repl_mismatch=False cpu_util_pct=52.2 mem_util_pct=18.3 cpu_series_matched=True mem_series_matched=True utilization_trustworthy=True
[analysis] experiment_written scaling_hint=None failure_reason=cpu_utilization_exceeded
[analysis] llm_analyze_start mode=squeeze analysis_goal=efficiency optimizer=llm vanilla=True user_prompt_chars=1842
[llm] request_start model=gpt-4o-mini system_chars=1631 user_chars=1842
[llm] response_received id=chatcmpl-Dp5idMycvQtM0QxAC8zR2Vnht4nTB prompt_tokens=915 completion_tokens=491 total_tokens=1406
[llm] response_parse_ok keys=['deployment_yaml_new', 'evidence', 'failure_archetype', 'hpa_yaml_new', 'lambda_crit_estimate', 'next_experiment', 'optimization_headroom', 'over_provisioned', 'report']
[analysis] llm_analyze_done failure_archetype=CPU_THROTTLING has_deployment_yaml_new=True has_hpa_yaml_new=True down_boundary=True
[analysis] outputs_written run_dir=/app/results/squeeze-compare-vanilla-llm/run-1/iteration-6 diff_nonempty=True report_chars=251
Run output: /app/results/squeeze-compare-vanilla-llm/run-1/iteration-6
  k6-run-summary.json, experiment.json, analysis.json, report.md, recommended.diff
  Failure archetype: CPU_THROTTLING
[pipeline] analysis_done run_dir=/app/results/squeeze-compare-vanilla-llm/run-1/iteration-6
[pipeline] experiment_status=FAIL failure_reason=cpu_utilization_exceeded burn_m=167.0 cpu_pct_req=104.4 repl=2 prom_pods=2 repl_mismatch=False cpu_util_pct=52.2 mem_util_pct=18.3 utilization_trustworthy=True per_pod=['web-694bbcb97b-wrhqg:109.6', 'web-694bbcb97b-6gskw:57.4']
[squeeze] Iteration 6 FAIL, cost=0.1518; stopping.
[squeeze] Optimal frontier (last PASS): /app/results/squeeze-compare-vanilla-llm/run-1/iteration-5
[squeeze] First FAIL: /app/results/squeeze-compare-vanilla-llm/run-1/iteration-6
# Squeeze optimizer comparison

## Summary

- **Cost model**: `weighted` (see cost_model.md) — **prov cost** / **util cost**: same N×(p_cpu·r + p_mem·m); util uses effective r·u

- **advanced-llm**: `optimizer=llm` · `stopped_reason=first_fail` · iterations=6 · `best_pass_dir=/app/results/squeeze-compare-advanced-llm/run-1/iteration-5` · prov_cost_total=126.914035 (steady=126.864, best_pass=0.1762), util_cost_total=59.993505 (steady=59.976, best_pass=0.0833)
- **vanilla-llm**: `optimizer=llm` · `stopped_reason=first_fail` · iterations=6 · `best_pass_dir=/app/results/squeeze-compare-vanilla-llm/run-1/iteration-5` · prov_cost_total=123.025813 (steady=122.976, best_pass=0.1708), util_cost_total=52.287758 (steady=52.272, best_pass=0.0726)

## Resource delta (first row → last row)

| | 🟩 CPU req (m) | 🟧 Mem req (MiB) |
|---|---:|---:|
| advanced-llm | -65.0 | -35.0 |
| vanilla-llm | -70.0 | -35.0 |

## Combined iterations

One row per iteration index (boundary `rows` order). Rows are **not** matched configs — each arm ran an independent squeeze trajectory. When `paired-baseline-probe.md` exists under each arm, **row 1** shares the same observed burn/cpu% (one k6 window, two optimizer analyses).

| # | advanced-llm status | ⬜ advanced-llm prov cost | ⬜ advanced-llm util cost | advanced-llm p95 | advanced-llm err | advanced-llm ach RPS | advanced-llm cpu% req | advanced-llm mem% | 🟩 advanced-llm cpu m | 🟧 advanced-llm mem Mi | advanced-llm cpu lim | advanced-llm mem lim | advanced-llm repl | vanilla-llm status | ⬜ vanilla-llm prov cost | ⬜ vanilla-llm util cost | vanilla-llm p95 | vanilla-llm err | vanilla-llm ach RPS | vanilla-llm cpu% req | vanilla-llm mem% | 🟩 vanilla-llm cpu m | 🟧 vanilla-llm mem Mi | vanilla-llm cpu lim | vanilla-llm mem lim | vanilla-llm repl |
| --- | --- | --- | --- | --- | --- | --- | --- | --- | --- | --- | --- | --- | --- | --- | --- | --- | --- | --- | --- | --- | --- | --- | --- | --- | --- | --- |
| 1 | PASS | 0.7116 | 0.1712 | 74 | 0 | 25 | 49.6 | 10.5 | 150 | 75 | 300 | 150 | 5 | PASS | 0.7116 | 0.1739 | 74 | 0 | 25 | 50.5 | 10.5 | 150 | 75 | 300 | 150 | 5 |
| 2 | PASS | 0.5114 | 0.1856 | 74 | 0 | 25 | 70.3 | 18.9 | 135 | 65 | 255 | 128 | 4 | PASS | 0.4554 | 0.116 | 74 | 0 | 25 | 51.8 | 17.4 | 120 | 60 | 240 | 120 | 4 |
| 3 | PASS | 0.3266 | 0.124 | 74 | 0 | 25 | 73.1 | 19.8 | 115 | 55 | 216 | 109 | 3 | PASS | 0.3131 | 0.1169 | 74 | 0 | 25 | 77.2 | 14.1 | 110 | 55 | 220 | 110 | 3 |
| 4 | PASS | 0.1952 | 0.079 | 75 | 0 | 25 | 79 | 14.9 | 103 | 50 | 195 | 98 | 2 | PASS | 0.1898 | 0.0743 | 75 | 0 | 25 | 81.1 | 14.7 | 100 | 50 | 200 | 100 | 2 |
| 5 | PASS | 0.1762 | 0.0833 | 75 | 0 | 25 | 86.8 | 16.6 | 93 | 45 | 165 | 88 | 2 | PASS | 0.1708 | 0.0726 | 75 | 0 | 25 | 87.9 | 16.4 | 90 | 45 | 180 | 90 | 2 |
| 6 | FAIL | 0.0804 | 0.0571 | 5 | 0 | 25 | 129.5 | 23.1 | 85 | 40 | 150 | 80 | 1 | FAIL | 0.1518 | 0.0766 | 75 | 0 | 25 | 104.4 | 18.3 | 80 | 40 | 160 | 80 | 2 |

## Cost per iteration

One row per iteration; prov cost and util cost only (easier to scan than the full table above).

| # | advanced-llm status | ⬜ advanced-llm prov cost | ⬜ advanced-llm util cost | vanilla-llm status | ⬜ vanilla-llm prov cost | ⬜ vanilla-llm util cost |
| --- | --- | --- | --- | --- | --- | --- |
| 1 | PASS | 0.7116 | 0.1712 | PASS | 0.7116 | 0.1739 |
| 2 | PASS | 0.5114 | 0.1856 | PASS | 0.4554 | 0.116 |
| 3 | PASS | 0.3266 | 0.124 | PASS | 0.3131 | 0.1169 |
| 4 | PASS | 0.1952 | 0.079 | PASS | 0.1898 | 0.0743 |
| 5 | PASS | 0.1762 | 0.0833 | PASS | 0.1708 | 0.0726 |
| 6 | FAIL | 0.0804 | 0.0571 | FAIL | 0.1518 | 0.0766 |
[advanced-vanilla-compare] wrote /app/results/squeeze-optimizer-comparison.md